<script setup>
const termsData = [
    {
        title: "Условия сервиса",
        description: "Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?"
    },
    {
        title: "Условия доставки",
        description: "Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?"
    },
    {
        title: "Условия возврата",
        description: "Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?"
    },
]

</script>

<template>
    <g-container>
        <div class="terms">
            <div class="terms-block" v-for="(item, key) in termsData" :key="key">
                <h2 class="terms-title">{{ item.title }}</h2>
                <p class="terms-description ">{{ item.description }}</p>
            </div>
        </div>
    </g-container>
</template>

<style scoped>
.terms {
    display: flex;
    flex-direction: column;
    gap: 33px;
    margin: 60px 0 120px 0;
}

.terms-block {
    box-shadow: 0 4px 20px rgba(0, 0, 0, 0.2); /* Увеличенная тень */
    background-color: #FFFFFF;
    border-radius: 36px;
    padding: 28px 30px 40px 31px;
}

.terms-title {
    margin-bottom: 15px;
}

.terms-description {
    font-size: 18px;
    padding-left: 20px;
}
</style>
